billing_cf/InformationRegisters/энргДатыОтчетногоПериодыОбщиеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргДатыОтчетногоПериодыОбщиеНастройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Завершение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

billing_cf/InformationRegisters/энргНастройкаСезонностиУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНастройкаСезонностиУслуг</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеПрименятьСезонность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемЗаПрошлыйГод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорректироватьГодовойОбъем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентНеПрименятьСезонность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеИспользованияТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

billing_cf/CommonModules/энргРаботаСПериодомДействия/Ext/Module.bsl
#Область ЭкспортныеПроцедуры

Функция ОпределитьПериодНачисления(ДатаДокумента, Организация, Район) Экспорт
	Дата						= ?(Не ЗначениеЗаполнено(ДатаДокумента),ТекущаяДата(),ДатаДокумента);
	ДатаКонстанта 				= РегистрыСведений.энргДатыОтчетногоПериодыОбщиеНастройки.ЗавершениеПериодаНачисленияПоОрганизации(Организация, Район);
	ЧислоЗавершенияПоРегистру 	= РегистрыСведений.энргДатыОтчетногоПериоды.ЗавершениеПериодаНачисления(Организация, Район, НачалоМесяца(Дата));
	
	Если Не ЗначениеЗаполнено(ДатаКонстанта) и ЗначениеЗаполнено(ЧислоЗавершенияПоРегистру) Тогда
		ДатаКонстанта 			= ЧислоЗавершенияПоРегистру;
	ИначеЕсли Не ЗначениеЗаполнено(ДатаКонстанта) Тогда
		ДатаКонстанта 			= 27;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена константа 'День завершения расчетного периода'");
	КонецЕсли;
	
	КолВоДнейВМесяце 			= День(КонецМесяца(Дата));
	ДнейСНачалоПериода			= Мин(ДатаКонстанта, КолВоДнейВМесяце);
	ЧислоЗавОП					= НачалоМесяца(Дата) + ДнейСНачалоПериода  * 86400;
	
	Если Дата < ЧислоЗавОП Тогда
		ВозвратнаяДата			= НачалоМесяца(Дата);
	Иначе
		ВозвратнаяДата			= НачалоМесяца(ДобавитьМесяц(Дата,1));
	КонецЕсли;
	
	Возврат ВозвратнаяДата;
КонецФункции

Процедура ПровестиПоСтабильнымПериодам(ссылка,Параметры) Экспорт 
	
	Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПериодомДействия();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ПровестиПоСтабильнымПериодам(ссылка,Параметры);

КонецПроцедуры

Процедура ПровестиПоСтабильнымПериодамМКД(ссылка,Параметры) Экспорт 
	
	Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПериодомДействия();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ПровестиПоСтабильнымПериодамМКД(ссылка,Параметры);
	
КонецПроцедуры

Процедура ПровестиПоСтабильнымПериодамНП(ссылка,Параметры) Экспорт 
	
	Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПериодомДействия();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ПровестиПоСтабильнымПериодамНП(ссылка,Параметры);

КонецПроцедуры

Функция ЗаполнитьДанныеДляПерерасчета(Объект,ИмяКоллекции = Неопределено,ИскатьТолькоПоКлючуПомещения = Ложь) Экспорт 
	
	ОперацияПриборами  = ТипЗнч(Объект) = Тип("ДокументОбъект.энргОперацияСЛицевымСчетом")
	ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.энргОперацияСУслугами")
	ИЛИ (ТипЗнч(Объект) = Тип("ДокументОбъект.энргОперацияСПриборомУчета") И Объект.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ);
	
	Если ОперацияПриборами Тогда
		ПерерасчетСНачалаГода 		= ВводПрибораСезоннойУслугиБезКорректировкиГодовогоОбъема(Объект);
		Если Не ПерерасчетСНачалаГода И не ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия) Тогда
			Возврат Неопределено;
		КонецЕсли;		
	ИначеЕсли не ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия) тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументыПоОснованию 				= КритерииОтбора.СвязанныеДокументы.Найти(Объект.ссылка);
	
	ПерерасчетыПоОснованию 				= Новый Массив;
	
	Для Каждого документ из  ДокументыПоОснованию цикл
		Если ТипЗнч(документ) = Тип("ДокументСсылка.энргПерерасчет") тогда
			Если НЕ документ.ПометкаУдаления Тогда
				ПерерасчетыПоОснованию.Добавить(документ);
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	Помещения							= Новый Массив;
	Если ИмяКоллекции = Неопределено Тогда		
		Абонент  						= Справочники.энргАбоненты.ПустаяСсылка();
		АбонентСмена					= Справочники.энргАбоненты.ПустаяСсылка();
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Абонент", Объект.Метаданные()) Тогда
			Абонент 					= Объект.Абонент;
		КонецЕсли;
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("АбонентСмена", Объект.Метаданные()) Тогда 
			АбонентСмена 				= Объект.АбонентСмена;
		КонецЕсли;

		Помещения.Добавить(Новый Структура("Абонент,КлючПомещения,АбонентСмена", Абонент, Объект.КлючПомещения, АбонентСмена));
		ДополнитьПомещенияКоммунальнойКвартиры(Объект, Помещения);
		
		Если ЗначениеЗаполнено(АбонентСмена) Тогда
			Помещения.Добавить(Новый Структура("Абонент,КлючПомещения,АбонентСмена", АбонентСмена, Объект.КлючПомещения,Справочники.энргАбоненты.ПустаяСсылка()));
		КонецЕсли;
		
		МассивАбонентовПлательщиков	= Объект.ПолучитьАбонентовПлательщиков();
		Для Каждого ТекАбонентПлательщик Из МассивАбонентовПлательщиков Цикл
			Помещения.Добавить(ТекАбонентПлательщик); 
		КонецЦикла;
	Иначе
		мМетаданные  					= Объект.Метаданные();
		мМетаданныеКоллекции 			= мМетаданные.ТабличныеЧасти.Найти(ИмяКоллекции);
		ЕстьРеквизит 					= ОбщегоНазначения.ЕстьРеквизитОбъекта("Абонент", мМетаданныеКоллекции);	
		
		Для Каждого СтрокаПомещения Из Объект[ИмяКоллекции]  Цикл
			Абонент  					= Справочники.энргАбоненты.ПустаяСсылка();
			Если ЕстьРеквизит Тогда
				Абонент 				= СтрокаПомещения.Абонент;
			КонецЕсли;			
			Помещения.Добавить(Новый Структура("Абонент,КлючПомещения",Абонент,СтрокаПомещения.КлючПомещения));
		КонецЦикла;		
	КонецЕсли; 	
	
	ДанныеПерерасчет 					= Новый Структура;
	ДанныеЗаполнения  					= Новый Структура("Абонент,Организация,Район,ЧастныйСектор,Строение,ВидОперации,ПериодНачисления");
	ЗаполнитьЗначенияСвойств(ДанныеЗаполнения,Объект,"Организация,Район");
	ДанныеПомещенияПоКлючу 				= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(Объект.КлючПомещения);
	ВыборкаДанныеПомещенияПоКлючу 		= ДанныеПомещенияПоКлючу.Выбрать();	
	
	Если ВыборкаДанныеПомещенияПоКлючу.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения,ВыборкаДанныеПомещенияПоКлючу,"ЧастныйСектор,Строение");
	КонецЕсли; 
	
	Если ДанныеЗаполнения.ЧастныйСектор Тогда
		ДанныеЗаполнения.Строение  		= Справочники.энргСтроения.ПустаяСсылка();
	КонецЕсли;
	
	ДанныеЗаполнения.ПериодНачисления	= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, ДанныеЗаполнения.Организация, ДанныеЗаполнения.Район);
	ДанныеЗаполнения.ВидОперации 		= Перечисления.энргВидыОпераций.энргПерерасчет_ИзменениеПараметраРассчета;
	ДанныеЗаполнения.Вставить("ДокументОснование",			Объект.ссылка);
	ДанныеЗаполнения.Вставить("Помещения", 					Помещения);
	ДанныеПерерасчет.Вставить("ДополнительныеПараметры", 	Новый Структура("ПерерасчетСНачалаГода", ПерерасчетСНачалаГода));
	Если ПерерасчетыПоОснованию.Количество() > 1 тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Найдено более одного документа перерасчет");
		ДанныеПерерасчет.Вставить("ДанныеЗаполнения",ДанныеЗаполнения);
	ИначеЕсли ПерерасчетыПоОснованию.Количество() = 0 тогда
		ДокументПерерасчета  			= ПерерасчетВПериоде(Объект.ПериодНачисления,Объект.Абонент,Объект.КлючПомещения,ИскатьТолькоПоКлючуПомещения);
		Если ЗначениеЗаполнено(ДокументПерерасчета) тогда
			ДанныеПерерасчет.Вставить("Ключ",ДокументПерерасчета);
		КонецЕсли; 		
		ДанныеПерерасчет.Вставить("ДанныеЗаполнения",ДанныеЗаполнения);		
	иначе
		ДанныеПерерасчет.Вставить("Ключ",ПерерасчетыПоОснованию[0]);
		ДанныеПерерасчет.Вставить("ДанныеЗаполнения",ДанныеЗаполнения);
	КонецЕсли; 
	
	Возврат ДанныеПерерасчет;
	
КонецФункции

Функция ЗаполнитьДанныеДляПерерасчетаПриПометкеУдаления(Объект) Экспорт 
	
	ДанныеПерерасчет 				= Неопределено;		
	СвязанныеДокументы 				= КритерииОтбора.СвязанныеДокументы.Найти(Объект.Ссылка);
	мДокументыПерерасчета 			= Новый Массив;
	Для Индекс = 0 По СвязанныеДокументы.ВГраница() Цикл
		Если ТипЗнч(СвязанныеДокументы[Индекс]) = Тип("ДокументСсылка.энргПерерасчет") Тогда
			мДокументыПерерасчета.Добавить(СвязанныеДокументы[Индекс]);
		КонецЕсли;			
	КонецЦикла;
	
	Если НЕ мДокументыПерерасчета.Количество() = 0 Тогда
		ЗначенияРеквизитов 			= ОбщегоНазначения.ЗначениеРеквизитаОбъектов(мДокументыПерерасчета,"ПометкаУдаления");
		Для Каждого КлючЗначение Из ЗначенияРеквизитов Цикл
			Если КлючЗначение.Значение Тогда
				Продолжить;
			КонецЕсли;
			ДанныеПерерасчет 		= Новый Структура;
			ДанныеЗаполнения 		= Новый Структура; 
			ДанныеЗаполнения.Вставить("ДокументОснованиеИсключить",	Объект.ссылка);
			ДанныеПерерасчет.Вставить("Ключ",						КлючЗначение.Ключ);
			ДанныеПерерасчет.Вставить("ДанныеЗаполнения", 			ДанныеЗаполнения);
			ДанныеПерерасчет.Вставить("ДополнительныеПараметры", 	Новый Структура);
		КонецЦикла;			
	КонецЕсли;

	Возврат ДанныеПерерасчет;
	
КонецФункции

Процедура ЗаполнитьДанныеУстановкиФормулы(Объект) Экспорт
	ДанныеДляФормулы 				= Новый Структура;
	ДанныеЗаполнения  				= Новый Структура("Абонент,Район,МКД,ЛицевойСчет,АдресОбъекта,Дата,ДатаФактическогоСобытия");
	энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(Объект.Абонент,ДанныеЗаполнения);
	ДанныеЗаполнения.Абонент 		= Объект.Абонент;
	ДанныеЗаполнения.Дата 			= Объект.Дата + 1;
	ДанныеЗаполнения.ДатаФактическогоСобытия 			= Объект.ДатаФактическогоСобытия;
	ДанныеЗаполнения.Вставить("ДокументОснование",Объект.ссылка);

	ДанныеДляФормулы.Вставить("ДанныеЗаполнения",ДанныеЗаполнения);	
	
	Объект.ДополнительныеСвойства.вставить("ДанныеДляФормулы",ДанныеДляФормулы);	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедуры

Процедура ДополнитьПомещенияКоммунальнойКвартиры(ОбъектОсновние, СписокПомещений)
	ПомещениеКлюча = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектОсновние.КлючПомещения, "Помещение");
	Если НЕ ЗначениеЗаполнено(ПомещениеКлюча) Тогда
		Возврат;
	КонецЕсли;
	
	РодительПомещения	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПомещениеКлюча, "Родитель");
	РодительПотомков	= ПомещениеКлюча;
	Если ЗначениеЗаполнено(РодительПомещения) Тогда 
		РодительПотомков = РодительПомещения;
		
		НСтрока	= Новый Структура("Абонент, КлючПомещения", Справочники.энргАбоненты.ПустаяСсылка(), РегистрыСведений.энргКлючиПомещений.КлючПомещенияПоСтроениюИПомещению(ПомещениеКлюча.Строение,РодительПомещения).КлючПомещения);
		СписокПомещений.Добавить(НСтрока);
	КонецЕсли;
	
	РезультатЗапроса 	= Обработки.энргКлючиПомещенийМенеджер.КлючиПомещенийПоРодителюПомещения(ОбъектОсновние.Организация, РодительПотомков);
	Выборка				= РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НСтрока	= Новый Структура("Абонент, КлючПомещения", "", "");
		ЗаполнитьЗначенияСвойств(НСтрока, Выборка);
		СписокПомещений.Добавить(НСтрока);
	КонецЦикла;
КонецПроцедуры

Функция ПерерасчетВПериоде(ПериодНачисления,Абонент,КлючПомещения,ИскатьТолькоПоКлючуПомещения)
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ПериодНачисления",ПериодНачисления);
	Запрос.УстановитьПараметр("Абонент",Абонент);
	Запрос.УстановитьПараметр("КлючПомещения",КлючПомещения);
	Текст 	=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	энргПерерасчетПомещения.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.энргПерерасчет.Помещения КАК энргПерерасчетПомещения
	|ГДЕ
	|	НЕ энргПерерасчетПомещения.Ссылка.ПометкаУдаления
	|	И энргПерерасчетПомещения.Абонент = &Абонент
	|	И энргПерерасчетПомещения.Ссылка.ПериодНачисления = &ПериодНачисления
	|	И энргПерерасчетПомещения.КлючПомещения = &КлючПомещения
	|
	|СГРУППИРОВАТЬ ПО
	|	энргПерерасчетПомещения.Ссылка";
	
	Если ЗначениеЗаполнено(ИскатьТолькоПоКлючуПомещения) Тогда 
		Текст = СтрЗаменить(Текст, "энргПерерасчетПомещения.Абонент = &Абонент", "Истина");
	Иначе
		
	КонецЕсли;
	
	Запрос.Текст 	= Текст;

	результат  = Запрос.Выполнить();
	Если результат.Пустой() тогда
		Возврат Документы.энргПерерасчет.ПустаяСсылка();
	иначе
		Выборка  = результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.ссылка;
	КонецЕсли;
КонецФункции

Функция ВводПрибораСезоннойУслугиБезКорректировкиГодовогоОбъема(ДокументОбъект)
	ДанныеСтроения  = ДокументОбъект.ДополнительныеСвойства.ДанныеСтроения;
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", 		ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("Организация", 	ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("Район", 			ДокументОбъект.Район);
	Запрос.УстановитьПараметр("Период",			НачалоГода(ДокументОбъект.Дата));
	Запрос.УстановитьПараметр("МКД", 			?(ДанныеСтроения.ЧастныйСектор,Справочники.энргСтроения.ПустаяСсылка(),ДанныеСтроения.Строение));
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргНастройкаСезонностиУслугСрезПоследних.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргНастройкаСезонностиУслугСрезПоследних.Услуга КАК Услуга,
	|	энргНастройкаСезонностиУслугСрезПоследних.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	энргНастройкаСезонностиУслугСрезПоследних.КорректироватьГодовойОбъем КАК КорректироватьГодовойОбъем,
	|	0 КАК Приоритет
	|ПОМЕСТИТЬ НаборУслугПерерасчетНачалоГода
	|ИЗ
	|	РегистрСведений.энргНастройкаСезонностиУслуг.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД) КАК энргНастройкаСезонностиУслугСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргНастройкаСезонностиУслугСрезПоследних.НаправлениеИспользованияТУ,
	|	энргНастройкаСезонностиУслугСрезПоследних.Услуга,
	|	энргНастройкаСезонностиУслугСрезПоследних.НеПрименятьСезонность,
	|	энргНастройкаСезонностиУслугСрезПоследних.КорректироватьГодовойОбъем,
	|	1
	|ИЗ
	|	РегистрСведений.энргНастройкаСезонностиУслуг.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|				И НЕ &МКД = ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)) КАК энргНастройкаСезонностиУслугСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборУслугПерерасчетНачалоГода.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	НаборУслугПерерасчетНачалоГода.Услуга КАК Услуга
	|ПОМЕСТИТЬ УслугиПерерасчетНачалоГода
	|ИЗ
	|	(ВЫБРАТЬ
	|		НаборУслугПерерасчетНачалоГода.Услуга КАК Услуга,
	|		НаборУслугПерерасчетНачалоГода.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		МИНИМУМ(НаборУслугПерерасчетНачалоГода.Приоритет) КАК Приоритет
	|	ИЗ
	|		НаборУслугПерерасчетНачалоГода КАК НаборУслугПерерасчетНачалоГода
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НаборУслугПерерасчетНачалоГода.Услуга,
	|		НаборУслугПерерасчетНачалоГода.НаправлениеИспользованияТУ) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборУслугПерерасчетНачалоГода КАК НаборУслугПерерасчетНачалоГода
	|		ПО ВложенныйЗапрос.Услуга = НаборУслугПерерасчетНачалоГода.Услуга
	|			И ВложенныйЗапрос.НаправлениеИспользованияТУ = НаборУслугПерерасчетНачалоГода.НаправлениеИспользованияТУ
	|			И ВложенныйЗапрос.Приоритет = НаборУслугПерерасчетНачалоГода.Приоритет
	|ГДЕ
	|	НаборУслугПерерасчетНачалоГода.НеПрименятьСезонность
	|	И НЕ НаборУслугПерерасчетНачалоГода.КорректироватьГодовойОбъем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА энргВидыУслугСоставляющиеУслуг.Ссылка ЕСТЬ NULL
	|				ТОГДА ВложенныйЗапрос.Услуга
	|			ИНАЧЕ энргВидыУслугСоставляющиеУслуг.Услуга
	|		КОНЕЦ КАК Услуга,
	|		ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ТаблицаТочкиУчета.Услуга КАК Услуга,
	|			ТаблицаТочкиУчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ
	|		ИЗ
	|			Документ.энргОперацияСЛицевымСчетом.ТочкиУчета КАК ТаблицаТочкиУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСЛицевымСчетом КАК Шапка
	|				ПО ТаблицаТочкиУчета.Ссылка = Шапка.Ссылка
	|					И (ТаблицаТочкиУчета.Ссылка = &Ссылка)
	|					И (Шапка.Ссылка = &Ссылка)
	|					И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС))
	|					И (НЕ ТаблицаТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ТаблицаТочкиУчета.Услуга,
	|			ТаблицаТочкиУчета.НаправлениеИспользованияТУ
	|		ИЗ
	|			Документ.энргОперацияСУслугами.ТочкиУчета КАК ТаблицаТочкиУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСУслугами КАК Шапка
	|				ПО ТаблицаТочкиУчета.Ссылка = Шапка.Ссылка
	|					И (ТаблицаТочкиУчета.Ссылка = &Ссылка)
	|					И (Шапка.Ссылка = &Ссылка)
	|					И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги))
	|					И (НЕ ТаблицаТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ТаблицаТочкиУчета.Услуга,
	|			ТаблицаТочкиУчета.НаправлениеИспользованияТУ
	|		ИЗ
	|			Документ.энргОперацияСПриборомУчета.ТочкиУчета КАК ТаблицаТочкиУчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСПриборомУчета КАК Шапка
	|				ПО ТаблицаТочкиУчета.Ссылка = Шапка.Ссылка
	|					И (ТаблицаТочкиУчета.Ссылка = &Ссылка)
	|					И (Шапка.Ссылка = &Ссылка)
	|					И (Шапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ))
	|					И (НЕ ТаблицаТочкиУчета.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяСсылка))) КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|			ПО ВложенныйЗапрос.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиПерерасчетНачалоГода КАК УслугиПерерасчетНачалоГода
	|		ПО ВложенныйЗапрос.Услуга = УслугиПерерасчетНачалоГода.Услуга
	|			И ВложенныйЗапрос.НаправлениеИспользованияТУ = УслугиПерерасчетНачалоГода.НаправлениеИспользованияТУ";
	
	Результат  = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции

#КонецОбласти

#Область КонтрольИзмененияДатыФактическогоСобытия

Функция ПолучитьКорректностьДатыФактическогоСобытия(Организация, Район, ДатаДокумента, ДатаФактическогоСобытия) Экспорт
	
	Результат = Истина;
	
	Если ДатаФактическогоСобытия = Дата(1,1,1) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПериодФактическогоСобытия = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ДатаФактическогоСобытия, Организация, Район);
	ПериодДокумента = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ДатаДокумента, Организация, Район);
	
	Если Не ПериодФактическогоСобытия < ПериодДокумента Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьДатуФактическогоСобытияПередЗаписьюДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Не РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	КорректностьДатыФактическогоСобытия = ПолучитьКорректностьДатыФактическогоСобытия(Источник.Организация, Источник.Район, Источник.Дата, Источник.ДатаФактическогоСобытия);
	
	Если Не КорректностьДатыФактическогоСобытия Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Период даты факта должен быть меньше периода даты документа");
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
